## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 9 to add, 0 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_lambda_permission.api-permission-s3 must be replaced
-/+ resource "aws_lambda_permission" "api-permission-s3" {
      ~ id            = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ source_arn    = "arn:aws:s3:::scan-websites-production-axe-core-report-data" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.axe-core-report-data will be destroyed
  - resource "aws_s3_bucket" "axe-core-report-data" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::scan-websites-production-axe-core-report-data" -> null
      - bucket                      = "scan-websites-production-axe-core-report-data" -> null
      - bucket_domain_name          = "scan-websites-production-axe-core-report-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "scan-websites-production-axe-core-report-data.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "scan-websites-production-axe-core-report-data" -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCenter" = "scan-websites-production"
        } -> null
      - tags_all                    = {
          - "CostCenter" = "scan-websites-production"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.axe-core-screenshots will be destroyed
  - resource "aws_s3_bucket" "axe-core-screenshots" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::scan-websites-production-axe-core-screenshots" -> null
      - bucket                      = "scan-websites-production-axe-core-screenshots" -> null
      - bucket_domain_name          = "scan-websites-production-axe-core-screenshots.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "scan-websites-production-axe-core-screenshots.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "scan-websites-production-axe-core-screenshots" -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCenter" = "scan-websites-production"
        } -> null
      - tags_all                    = {
          - "CostCenter" = "scan-websites-production"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_notification.api-notification must be replaced
-/+ resource "aws_s3_bucket_notification" "api-notification" {
      ~ bucket = "scan-websites-production-axe-core-report-data" -> (known after apply) # forces replacement
      ~ id     = "scan-websites-production-axe-core-report-data" -> (known after apply)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20210813142904894500000001" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_s3_bucket_public_access_block.axe-core-report-data will be destroyed
  - resource "aws_s3_bucket_public_access_block" "axe-core-report-data" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "scan-websites-production-axe-core-report-data" -> null
      - id                      = "scan-websites-production-axe-core-report-data" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.axe-core-screenshots will be destroyed
  - resource "aws_s3_bucket_public_access_block" "axe-core-screenshots" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "scan-websites-production-axe-core-screenshots" -> null
      - id                      = "scan-websites-production-axe-core-screenshots" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.axe-core-report-data.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-production-axe-core-report-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire"

          + expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "scan-websites-production-axe-core-report-data"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.axe-core-report-data.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.axe-core-screenshots.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-production-axe-core-screenshots"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire"

          + expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "scan-websites-production-axe-core-screenshots"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.axe-core-screenshots.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-production-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.log_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 9 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ axe_core_report_data_bucket_id = "scan-websites-production-axe-core-report-data" -> (known after apply)
  ~ axe_core_screenshots_bucket_id = "scan-websites-production-axe-core-screenshots" -> (known after apply)
  + log_bucket_id                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>